2014.org
* 2014

2014就这么走了，留下了感触和遗憾。

** 状态问题

- 2013过年时，在民勤待了一周，状态不好，朵朵差点爬下床
- 7月份，在504带着朵朵，状态不好，朵朵吧嘴摔破了
- 每个周六周日，都有些小问题，把心情搞坏
- 每次大姨子来家里，都心情不好，尤其在10月份，他们从民勤回来时，为了招
  待姐夫，干的那些不堪的事
- 8月份，给大姨子搬家，到了家里，不知干什么，自动焦虑紧张，没有任何关
  于搬家的考虑，不知道如何搬衣柜，不知道哪些要搬到自己家，整个是在自我
  状态下对外界刺激反应
- 这样的状态贯穿了2013-2014，是最大的问题

** 工作问题

- 2013-2014在北京埃昂赛上班，上班经常受到负面情绪的影响
- 在状态不好的情况下完成了PDA软件开发
- 2013-2014年在程序上进步不大
- 从6月开始，公司就发不出工资了，我为了有时间准备架构考试，更多的是状
  态不好，一直没有考虑换工作，现在公司欠我们半年工资
- 从7月开始，一直没有什么工作，在这样的宽松时间里，程序没什么进展，羞杀人了！
- 11月开始，看spring有点感觉，继续

** 考试问题

- 系统架构师考试，是我今年最重要的事，从6月考试准备，有近半年时间，全
  部搭在上面，买了各种书籍，资料
- 10月份，由于感觉没有把握，又报了希赛培训，3800元
- 复习进展很满啊，还是状态问题，10月这个月，主要是准备论文，每天抄一篇，
  准备了4篇
- 11月8日考试，案例分析考试，有焦虑紧张，写字手发抖，虽然题不难，12月
  30日，成绩公布，58,40,56，还真是，案例没过
- 回想起来，案例不过也是必然，状态不好，还是自身问题，论文考的好，那是
  准备的扎实，而且考试时状态还不错，案例不过，认了，明年再来！

** 一年的感触

- 状态决定了一切，生活、工作、考试
- 2014的状态就是这样，结果自然就是这样，不管做了什么努力，坦然接受
- 虽然架构考试准备充分，但是状态差了，照样不行，要达到目标，就要达到比
  目标更高的位置，以摧枯拉朽之势搞定
- 公司有问题，要提早做出决策，今年是为了考试，认了

** 2015年目标

- 都是自己的问题，要直面它，与家人，亲戚，朋友一起，调整状态，有意识工
  作自己
- 在java世界里：spring、js，达到熟练构建web程序的能力
- 以github为入口上进入世界程序，同时搞定科技english
- 以智城为入口进入威客世界，成为真正的威客
- 更换工作，初步计划是移动公司的项目
- 进入围棋世界，进入甘肃围棋
- 高分通过架构考试



